-- Лабораторна робота №1
-- студента групи КН-32
-- підгрупа 1
-- Євдокимова Нікіти
-- Варіант №11

-- Мета: Ознайомитись з основними типами мови. Ознайомитись зi структурою та
-- функцiями Glasgow Haskell Compiller. Набути навичок роботи з iнтерпретатором
-- ghci та визначення найпростiших функцiй.

-- Завдання 1. Наведiть приклади виразiв вказаного типу [([Char],[Integer])]. 
-- Кожен список має мiстити кiлька елементiв.

-- [(['a','b','c'], [1,2,3,4,5])]
-- [("Hello", [1..10])]
-- [(['a'..'w'], [10,11,12,13,14])]

-- Завдання 2. Визначте два варiанти вказаних далi функцiй, де аргументи будуть представленi
-- а) як один кортеж, б) без використання кортежiв чи спискiв. 
-- Функцiя визначає, чи мiстить круг початок координат. Круг задається координатами центра та радiусом.

-- a)
func1 :: (Integer, Integer, Integer) -> Bool 
func1 (cx, cy, radius)
    | cx==0 && cy==0 = True
    | abs(cx) - radius == 0 && abs(cy) - radius == 0 = True
    | otherwise = False

-- б)
func2 :: Integer -> Integer -> Integer -> Bool 
func2 cx cy radius
    | cx==0 && cy==0 = True
    | abs(cx) - radius == 0 && abs(cy) - radius == 0 = True
    | otherwise = False


-- Тести: 
-- ghci> func2 0 0 2
-- True
-- ghci> func2 1 1 1
-- True
-- ghci> func2 3 4 5
-- False
--ghci> func1 (0,0,2)
--True


-- Висновок: В результаті виконання лабораторної роботи, ми ознайомилися з основними типами мови Haskell,
-- набули навичок роботи з інтерпритатором ghci та навчились визначати найпростіші функції.
