-- Лабораторна робота №2
-- студента групи КН-32
-- підгрупа 1
-- Євдокимова Нікіти
-- Варіант №11

-- Мета: Набути досвiду визначення рекурсивних функцiй, використання механiзму
-- зiставлення зi зразком i роботи з кортежами та списками.

-- Завдання: Визначте вказанi функцiї в кожному з завдань: а) без застосування, б) з
-- застосуванням вбудованих функцiй.
-- Завдання 1.4: Повторити n-кратно кожен елемент списку, напр. при n=2: "asd"⇒[’a’, ’a’, ’s’, ’s’, ’d’, ’d’].

-- Завдання 2.4: Обчислити функцiю Ейлера φ(m).


-- Завдання 1.4 a:
replace1 n lst = map (:[]) (concatMap (\x -> pov n x) lst)
pov n x = mypov n x []
mypov 0 x l = l
mypov n x l = l++x : mypov (n-1) x l

-- Завдання 1.4 б:
replace2 n lst = concatMap (\x -> replicate n x) lst

-- Завдання 2.4 a:
prime :: Int -> Int -> Bool
prime 0 y = if y>1 then False
                 else True
prime x y = if x>y then prime (x-y) y
                 else prime (y-x) x

eiler1 n = len_arr (filter (prime n) [1..n]) 0
len_arr [] n = n
len_arr (x:xs) n = len_arr xs (n+1)

-- Завдання 2.4 б:
eiler2 n = length (filter (prime n) [1..n])      


--Тести:
--ghci> replace1 2 "asd"
--["a","a","s","s","d","d"]
--ghci> replace2 2 "asd"
--"aassdd"
--ghci> eiler1 5
--4

-- Висновок: В результаті виконання лабораторної роботи, ми набули досвіду визначення рекурсивниї функцій,
-- навчилися використовувати механізм зіставлення зі зразком та попрацювали з кортежами та списками.